## Display Features

In [2]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings

In [3]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Load Dataset

In [57]:
connection = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\Football\\DataSet\\database.sqlite"
)

In [58]:
player = pd.read_sql(
    """
    SELECT * 
    FROM Player
    """,
    connection
)
player.head()

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight,last_name
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,None
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146,None
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163,None
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198,None
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154,None

In [69]:
drop1 = pd.read_sql(
    """
    ALTER TABLE Player DROP COLUMN birthday;
    """,
    connection,
)
drop1.head()

DatabaseError: Execution failed on sql '
    ALTER TABLE Player DROP COLUMN birthday;
    ': no such column: "birthday"

In [66]:
drop1.head()

NameError: name 'drop1' is not defined

In [67]:
player.head()

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight,last_name
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,None
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146,None
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163,None
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198,None
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154,None